export const patterns = {
	cc: '^[\\d]{5,10}$',
	ce: '^[\\d]{4,7}$',
	colorHexa: '^#([A-Fa-f0-9]{6}|[A-Fa-f0-9]{3})$',
	correo: '^((?!\\.)[\\w\\-_.]*[^.])(@\\w+)(\\.\\w+(\\.\\w+)?[^.\\W])$',
	fecha:
		'^(?:(?:19|20)\\d{2})-(0[1-9]|1[0-2])-(0[1-9]|[12]\\d|3[01])T([01]\\d|2[0-3]):([0-5]\\d):([0-5]\\d)\\.\\d{3}Z$',
	imagen: '^[a-zA-Z0-9_-]{2,20}.(png|svg|jpg|gif|jpeg|webp)$',
	imagenb64: '^data:image\\/(png|jpeg|jpg|gif);base64,[a-zA-Z0-9+/]+={0,2}$',
	imagenb64png: '^data:image\\/(png);base64,[a-zA-Z0-9+/]+={0,2}$',
	nit: '^([0-9]{9})+-{1}[0-9]{1}$',
	nombre: '^[a-zA-ZáéíóúÁÉÍÓÚñÑüÜ\\s]{2,40}$',
	pass: '^[\\wñÑ]{8,12}$',
	sigla: '^[A-Z]{3}$',
	tel: '^([3]{1})([01235]{1})[\\d]{8}$',
	text: '^[\\w\\s\\-\\/áéíóúÁÉÍÓÚñÑüÜ.,;:@&%#$+()¿?¡!¿?¡]{4,100}$',
	uuid: '^[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}$',
};
